{
  "backend/main.mo": "Main backend actor implementing timer session recording, custom timer presets, goal management, and wallpaper storage using blob-storage mixins with Map-based data structures.",
  "feature_evidence.json": "Feature evidence report documenting three features: fixing ambient sound player audio playback, adjusting timer vertical positioning, and ensuring proper spacing between motivational quote and timer display.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, pages, and configuration files describing the Study Sanctuary application architecture with flat white text design and wallpaper support.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH-based color system with CSS custom properties for light and dark themes, removing all shadow and transparency utilities for flat design.",
  "frontend/index.html": "HTML entry point loading Inter and JetBrains Mono fonts from Google Fonts with meta tags for the Study Sanctuary application.",
  "frontend/src/App.tsx": "Root application component managing page routing between Timer and Dashboard, integrating ThemeProvider, FocusMode overlay, keyboard shortcuts, and Toaster notifications.",
  "frontend/src/components/focus/FocusMode.tsx": "Full-screen focus mode overlay with a simple stopwatch timer, play/pause controls, and exit button displaying white text with drop shadows.",
  "frontend/src/components/goals/GoalManager.tsx": "Dialog component for creating daily study goals with input fields for goal name and target hours, using mutation hooks to save to backend.",
  "frontend/src/components/goals/GoalTracker.tsx": "Goal tracking widget displaying progress bars for daily study goals with achievement indicators, streak counts, and button to create new goals.",
  "frontend/src/components/help/KeyboardShortcutsHelp.tsx": "Dialog component that displays keyboard shortcuts (F for Focus Mode, ? for help) with a close button.",
  "frontend/src/components/layout/MainLayout.tsx": "Main application layout wrapper with navigation, wallpaper background, settings sheet, help dialog, and footer with caffeine.ai attribution.",
  "frontend/src/components/layout/Navigation.tsx": "Navigation component with buttons to switch between Timer and Dashboard pages using icons and active state styling.",
  "frontend/src/components/presets/PresetManager.tsx": "Dialog form for creating custom timer presets with fields for name, label, duration (5-120 min slider), and color theme, using mutation hook to save.",
  "frontend/src/components/quotes/MotivationalQuote.tsx": "Displays a random motivational quote with author and field, includes refresh button to cycle through quotes.",
  "frontend/src/components/sound/AmbientSoundPlayer.tsx": "Ambient sound player with grid of sound options, play/pause controls, and volume slider using custom useAmbientSound hook.",
  "frontend/src/components/spotify/SpotifyPlayer.tsx": "Spotify integration component showing current track with album art, playback controls (play/pause/skip), login/logout, using useSpotify hook.",
  "frontend/src/components/stats/StudyStats.tsx": "Dashboard displaying study statistics with tabs for different time periods, bar chart of last 7 days, tag filtering, and CSV export functionality.",
  "frontend/src/components/tags/TagInput.tsx": "A tag input component with autocomplete suggestions that allows users to add/remove tags by typing and pressing Enter, fetching existing tags from the backend for suggestions.",
  "frontend/src/components/timers/AnimedoroTimer.tsx": "Implements an Animedoro timer with alternating study and break phases, configurable study duration (40-60 min), and the ability to save sessions with tags to the backend.",
  "frontend/src/components/timers/CustomPresetTimer.tsx": "A timer component that allows users to select from custom presets, run countdown timers, and save completed sessions with tags; includes a preset manager dialog.",
  "frontend/src/components/timers/PomodoroTimer.tsx": "A Pomodoro technique timer with configurable work and break durations, alternating phases, settings dialog, and session saving with tags.",
  "frontend/src/components/timers/StopwatchTimer.tsx": "A stopwatch timer that counts up from zero with millisecond precision, allowing users to start/pause/reset and save elapsed time as a study session with tags.",
  "frontend/src/components/timers/TimerSection.tsx": "Main timer section component with tabs for Stopwatch, Pomodoro, Animedoro, and Custom timers, plus buttons for focus mode and preset management.",
  "frontend/src/components/wallpaper/WallpaperBackground.tsx": "Renders a full-screen background that supports both video and image wallpapers with smooth transitions, using the wallpaper context hook.",
  "frontend/src/components/wallpaper/WallpaperSelector.tsx": "React component that displays wallpapers organized by category (Study Spaces, Anime, Studio Ghibli, Nature, Custom) in a scrollable grid, allowing users to select wallpapers and includes a WallpaperUploader component.",
  "frontend/src/components/wallpaper/WallpaperUploader.tsx": "React component that provides two methods to upload custom wallpapers: file upload with progress tracking and URL-based upload, using ExternalBlob for handling uploads and toast notifications for feedback.",
  "frontend/src/data/quotes.ts": "Defines a Quote interface and exports an array of 25+ motivational and educational quotes from famous figures including scientists, philosophers, artists, and leaders, each with text, author, and optional field.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAmbientSound.ts": "Custom React hook that manages ambient sound playback (rain, coffee shop, forest, waves, white noise, lofi) with volume control, play/pause functionality, and localStorage persistence for user preferences.",
  "frontend/src/hooks/useAnimedoro.ts": "Custom React hook implementing the Animedoro technique with alternating study (40 min default) and break (20 min) phases, including timer controls, audio notifications, session tracking with tags, and localStorage persistence.",
  "frontend/src/hooks/useFocusMode.ts": "Simple custom React hook that manages focus mode state with toggle, enable, and disable functions, persisting the state to localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login/logout flow, identity state, AuthClient creation with configurable options, and automatic identity restoration from local storage.",
  "frontend/src/hooks/useKeyboardShortcuts.ts": "Provides keyboard shortcuts for the app: 'f' toggles focus mode and '?' shows keyboard help, ignoring keypresses when typing in input fields.",
  "frontend/src/hooks/usePomodoro.ts": "Implements a Pomodoro timer with work/break phases, configurable durations, session tracking with tags, audio notifications on completion, and automatic phase transitions after every 4 work sessions to long breaks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating timer sessions, presets, goals, tags, and data export/import operations using the backend actor.",
  "frontend/src/hooks/useSpotify.ts": "Manages Spotify OAuth authentication, token storage, and playback controls (play/pause/next/previous) with periodic polling of currently playing track.",
  "frontend/src/hooks/useStopwatch.ts": "Implements a stopwatch with start/pause/reset controls and session data export functionality, tracking elapsed time in 10ms intervals.",
  "frontend/src/hooks/useWallpaper.ts": "Manages wallpaper selection with predefined wallpapers (anime, ghibli, study, nature categories) and custom uploaded wallpapers, persisting selection to localStorage.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark themes using an aesthetic pastel color palette (lavender, peach, mint tones).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard page with study statistics and goal tracking components in a centered layout.",
  "frontend/src/pages/TimerPage.tsx": "Renders the timer page with motivational quotes, timer controls, ambient sound player, and Spotify player in a responsive grid layout.",
  "frontend/src/utils/exportData.ts": "Provides utility functions to convert timer sessions, presets, and goals to CSV format, and includes helpers for JSON conversion and file downloads with proper CSV escaping.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations (accordion), and custom font families (Inter, JetBrains Mono).",
  "project_state.json": "Project metadata describing a free aesthetic study website with multiple timer modes (stopwatch, Pomodoro, Animedoro), customizable wallpapers, Spotify integration, and study tracking features with known UI transparency and audio playback issues."
}