{
  "backend/main.mo": "Main backend actor implementing timer session recording, custom presets, goal management, tag tracking, wallpaper upload/fetch via blob storage, and data export functionality with in-memory Map storage.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: transparent UI with full wallpaper visibility, file upload for wallpapers, and functional ambient sound player with audio controls.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including hooks for timers, Spotify, wallpapers, queries, and components for layout, timers, stats, goals, and wallpaper management with transparent styling.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH-based color system defining CSS custom properties for light and dark themes, including variables for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with Inter and JetBrains Mono font imports from Google Fonts, meta tags, and root div for React application mounting.",
  "frontend/src/App.tsx": "Root application component managing page routing between Timer and Dashboard, integrating ThemeProvider, FocusMode overlay, keyboard shortcuts, and Toaster notifications.",
  "frontend/src/components/focus/FocusMode.tsx": "Full-screen focus mode overlay with transparent backdrop, large timer display, play/pause controls, and exit button using semi-transparent white styling.",
  "frontend/src/components/goals/GoalManager.tsx": "Dialog component for creating daily study goals with name and target hours inputs, using transparent styling and mutation hook for backend persistence.",
  "frontend/src/components/goals/GoalTracker.tsx": "Displays study goals with progress bars and achievement indicators, showing a trophy icon and streak count when goals are met. Includes an empty state with a call-to-action to create the first goal and a button to open the GoalManager dialog.",
  "frontend/src/components/help/KeyboardShortcutsHelp.tsx": "Modal dialog component that displays available keyboard shortcuts (F for Focus Mode, ? for help). Uses a semi-transparent backdrop-blur design consistent with the app's glassmorphism theme.",
  "frontend/src/components/layout/MainLayout.tsx": "Main application layout wrapper providing navigation between Timer and Dashboard pages, wallpaper background, settings sheet for wallpaper selection, keyboard shortcuts help, and a footer with Caffeine.ai attribution. Includes a top navigation bar with app branding and action buttons.",
  "frontend/src/components/layout/Navigation.tsx": "Navigation component with two buttons (Focus and Dashboard) that toggle between main app pages. Applies different styling to indicate the currently active page.",
  "frontend/src/components/presets/PresetManager.tsx": "Dialog form for creating custom timer presets with fields for name, display label, duration (1-180 minutes), and color theme. Submits data via useSavePreset mutation and shows toast notifications.",
  "frontend/src/components/quotes/MotivationalQuote.tsx": "Card component displaying a random motivational quote with author and field attribution. Includes a refresh button to cycle through different quotes from the quotes data.",
  "frontend/src/components/sound/AmbientSoundPlayer.tsx": "Audio player card for ambient background sounds with a grid of sound selection buttons, play/pause controls, and a volume slider. Uses the useAmbientSound hook to manage playback state.",
  "frontend/src/components/spotify/SpotifyPlayer.tsx": "Spotify integration component showing current track info with album art, playback controls (play/pause/skip), and login/logout functionality. Displays a connection prompt when not authenticated via the useSpotify hook.",
  "frontend/src/components/stats/StudyStats.tsx": "Displays study session statistics with charts and filters, showing daily/weekly/monthly/yearly hours, session counts, and a 7-day bar chart. Includes tag filtering and CSV export functionality.",
  "frontend/src/components/tags/TagInput.tsx": "A reusable tag input component with autocomplete suggestions from existing tags, allowing users to add/remove tags via keyboard or click interactions.",
  "frontend/src/components/timers/AnimedoroTimer.tsx": "Implements an Animedoro timer with alternating study and anime break phases, configurable study duration via slider, and session saving with tags.",
  "frontend/src/components/timers/CustomPresetTimer.tsx": "A countdown timer that uses user-created presets, allowing selection from saved presets and recording sessions with tags upon completion.",
  "frontend/src/components/timers/PomodoroTimer.tsx": "A Pomodoro technique timer with configurable work and break durations, alternating between work and break phases, and session saving with tags.",
  "frontend/src/components/timers/StopwatchTimer.tsx": "A stopwatch timer that counts up from zero with millisecond precision, allowing users to save elapsed time as study sessions with tags.",
  "frontend/src/components/timers/TimerSection.tsx": "Main timer section component that provides a tabbed interface for Stopwatch, Pomodoro, Animedoro, and custom preset timers, with buttons for focus mode and preset management.",
  "frontend/src/components/wallpaper/WallpaperBackground.tsx": "Renders the current wallpaper as a full-screen background with smooth transitions using the useWallpaper hook.",
  "frontend/src/components/wallpaper/WallpaperSelector.tsx": "Displays categorized wallpaper thumbnails in a scrollable grid, allowing users to select wallpapers and upload custom ones via WallpaperUploader.",
  "frontend/src/components/wallpaper/WallpaperUploader.tsx": "Handles wallpaper uploads from both local files and URLs, with progress tracking and validation, storing custom wallpapers via backend mutations.",
  "frontend/src/data/quotes.ts": "Defines a collection of 25 motivational quotes with authors and fields, plus a function to retrieve a random quote.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAmbientSound.ts": "Manages ambient sound playback with six predefined sounds (rain, coffee shop, forest, waves, white noise, lofi), handling volume control and localStorage persistence.",
  "frontend/src/hooks/useAnimedoro.ts": "Implements Animedoro timer logic with alternating study and break phases, tracking session data and tags for backend storage.",
  "frontend/src/hooks/useFocusMode.ts": "Manages focus mode state with localStorage persistence, providing toggle, enable, and disable functions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useKeyboardShortcuts.ts": "Implements global keyboard shortcuts (f for focus mode, ? for help) while ignoring events from input fields.",
  "frontend/src/hooks/usePomodoro.ts": "Manages Pomodoro timer state with work/break phases, configurable durations, session tracking, tags, and audio notifications on phase completion.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating timer sessions, presets, goals, tags, and data export/import operations via the backend actor.",
  "frontend/src/hooks/useSpotify.ts": "Manages Spotify OAuth authentication and playback control (play, pause, next, previous) with token persistence and current track polling.",
  "frontend/src/hooks/useStopwatch.ts": "Implements a stopwatch with start, pause, reset functionality and session data export for time tracking.",
  "frontend/src/hooks/useWallpaper.ts": "Manages wallpaper selection with predefined and custom wallpapers from backend, persisting user choice to localStorage.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light/dark theme color palettes using aesthetic pastel tones.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard page with study statistics and goal tracking components in a centered layout.",
  "frontend/src/pages/TimerPage.tsx": "Main timer page component that renders a layout with a motivational quote, timer section, ambient sound player, and Spotify player in a responsive grid.",
  "frontend/src/utils/exportData.ts": "Utility functions for converting timer sessions, presets, and goals to CSV/JSON format and downloading them as files, including CSV escaping and blob creation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color schemes using OKLCH, extended typography, container queries, animations (accordion, fade-in), and custom theme tokens for a design system.",
  "project_state.json": "Project metadata defining a free aesthetic study website with timer modes (stopwatch, Pomodoro, Animedoro), customizable wallpapers, Spotify integration, and study tracking features with anime/Studio Ghibli themes."
}