{
  "backend/main.mo": "Main backend actor implementing timer session recording, custom timer presets, goal management (daily targets with progress tracking), tag management, data export, and wallpaper storage using blob-storage mixin.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing ambient sound audio sources, adding error handling, and ensuring proper Audio element initialization in useAmbientSound.ts.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, and pages, describing the flat white text design system, timer functionality, wallpaper management with video support, and Spotify integration.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH-based color system with CSS custom properties for light and dark themes, removing all shadow and transparency utilities for flat design.",
  "frontend/index.html": "HTML entry point with Inter and JetBrains Mono font imports from Google Fonts and meta tags for the Study Sanctuary application.",
  "frontend/src/App.tsx": "Root application component managing page routing between Timer and Dashboard, integrating ThemeProvider, FocusMode overlay, keyboard shortcuts, and Toaster notifications.",
  "frontend/src/components/focus/FocusMode.tsx": "Full-screen focus mode overlay with a simple stopwatch timer, play/pause controls, and exit button, displaying white text with drop shadows over the wallpaper background.",
  "frontend/src/components/goals/GoalManager.tsx": "Dialog component for creating daily study goals with input fields for goal name and target hours, using mutation hooks to save goals to the backend.",
  "frontend/src/components/goals/GoalTracker.tsx": "Displays study goals with progress bars and achievement indicators, showing an empty state with a create button when no goals exist. Renders a list of goals with progress tracking, streak counts, and trophy icons for achieved goals.",
  "frontend/src/components/help/KeyboardShortcutsHelp.tsx": "Modal dialog component that displays available keyboard shortcuts (F for Focus Mode, ? for shortcuts help). Shows shortcuts in a list with key bindings and descriptions.",
  "frontend/src/components/layout/MainLayout.tsx": "Main application layout wrapper providing navigation, wallpaper background, settings sheet, and help dialog. Includes header with app branding, navigation between timer/dashboard pages, and footer with caffeine.ai attribution.",
  "frontend/src/components/layout/Navigation.tsx": "Navigation component with two buttons to switch between Timer and Dashboard pages. Highlights the currently active page with different button variants.",
  "frontend/src/components/presets/PresetManager.tsx": "Dialog form for creating custom timer presets with fields for name, label, duration (5-120 min slider), and color theme. Saves presets using mutation hook and displays toast notifications.",
  "frontend/src/components/quotes/MotivationalQuote.tsx": "Displays a random motivational quote with author and field attribution, featuring a refresh button to cycle through quotes. Uses getRandomQuote utility function for quote selection.",
  "frontend/src/components/sound/AmbientSoundPlayer.tsx": "Ambient sound player with grid of sound options, play/pause controls, and volume slider. Handles loading states, errors, and browser interaction requirements for audio playback.",
  "frontend/src/components/spotify/SpotifyPlayer.tsx": "Spotify integration component showing current track with album art, playback controls (play/pause/skip), and login/logout functionality. Displays connection prompt when not authenticated.",
  "frontend/src/components/stats/StudyStats.tsx": "Displays study statistics with tabs for different time periods (daily, weekly, monthly, yearly), a bar chart for the last 7 days, and filtering by tags. Includes CSV export functionality for session data.",
  "frontend/src/components/tags/TagInput.tsx": "A reusable tag input component with autocomplete suggestions from existing tags, allowing users to add tags by pressing Enter and remove them with an X button.",
  "frontend/src/components/timers/AnimedoroTimer.tsx": "Implements the Animedoro technique timer with configurable study duration (40-60 min), automatic break calculation, and session saving with tags. Alternates between study and break phases.",
  "frontend/src/components/timers/CustomPresetTimer.tsx": "A timer that uses user-defined presets with custom durations, labels, and colors. Includes preset selection, timer controls, and session saving with tags.",
  "frontend/src/components/timers/PomodoroTimer.tsx": "Implements the Pomodoro technique with configurable work and break durations, alternating between work and break phases. Includes settings dialog and session saving with tags.",
  "frontend/src/components/timers/StopwatchTimer.tsx": "A simple stopwatch timer that tracks elapsed time with millisecond precision, allowing users to start, pause, reset, and save sessions with tags.",
  "frontend/src/components/timers/TimerSection.tsx": "Main timer section component that provides a tabbed interface for Stopwatch, Pomodoro, Animedoro, and custom preset timers, with buttons for focus mode and preset management.",
  "frontend/src/components/wallpaper/WallpaperBackground.tsx": "Renders the full-screen background wallpaper, supporting both video and image types with smooth transitions.",
  "frontend/src/components/wallpaper/WallpaperSelector.tsx": "Displays categorized wallpaper thumbnails in a scrollable grid with selection state and includes the wallpaper uploader component.",
  "frontend/src/components/wallpaper/WallpaperUploader.tsx": "Provides UI for uploading custom wallpapers either from local files or URLs, with upload progress tracking and toast notifications.",
  "frontend/src/data/quotes.ts": "Contains an array of motivational quotes with authors and their fields, focused on education, learning, and personal growth.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the Internet Computer actor instance, creating authenticated or anonymous actors based on identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useAmbientSound.ts": "Manages ambient sound playback with volume control, sound selection, and error handling for various audio sources from Google's sound library.",
  "frontend/src/hooks/useAnimedoro.ts": "Implements the Animedoro timer technique with alternating study and break phases, session tracking, and tag management.",
  "frontend/src/hooks/useFocusMode.ts": "Simple hook for toggling focus mode state with localStorage persistence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useKeyboardShortcuts.ts": "Implements global keyboard shortcuts (F for focus mode, ? for help) while ignoring events from input fields.",
  "frontend/src/hooks/usePomodoro.ts": "Manages Pomodoro timer state with work/break phases, configurable durations, session tracking, and audio notifications on phase completion.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for all backend operations including sessions, presets, goals, tags, and data import/export functionality.",
  "frontend/src/hooks/useSpotify.ts": "Handles Spotify OAuth authentication and playback control (play, pause, next, previous) with token management and current track polling.",
  "frontend/src/hooks/useStopwatch.ts": "Implements a stopwatch with start, pause, reset controls and session data export functionality for time tracking.",
  "frontend/src/hooks/useWallpaper.ts": "Manages wallpaper selection with predefined anime/study/nature/Ghibli backgrounds and custom uploaded wallpapers, persisting selection to localStorage.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a pastel color palette (lavender primary, peach secondary, mint accent) for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page component that displays user progress with a header and renders GoalTracker and StudyStats components in a centered layout.",
  "frontend/src/pages/TimerPage.tsx": "Timer page component that displays a motivational quote at the top and arranges TimerSection, AmbientSoundPlayer, and SpotifyPlayer in a responsive grid layout.",
  "frontend/src/utils/exportData.ts": "Utility functions for exporting timer sessions, presets, and goals to CSV or JSON format, including CSV escaping and file download functionality.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors using OKLCH variables, border radius settings, custom fonts (Inter, JetBrains Mono), and accordion animations.",
  "project_state.json": "Project metadata defining a free aesthetic study website with timers (stopwatch, Pomodoro, Animedoro), customizable wallpapers, Spotify integration, study tracking, and architectural notes emphasizing flat UI design without shadows or effects."
}